    [
        {
         "id": 1,
         "company": "Walmart",
         "role": "Software Engineering",
         "location": "Bangalore or Chennai",
         "ctc": "up to ₹35 lakhs",
         "type": "full time",
         "experiance": "fresher",
         "branch": ["Btech","MCA","MBA","Mtech"],
         "cgpa": "Nil",
         "backlog": 1,
         "note": "For women students of 2022 and 2023 batches....",
         "about_job": "Walmart invites students who are graduating in 2022 and 2023 to take part in CodeHers, India’s biggest coding challenge, exclusively for women. CodeHers is your passport to join Walmart Global Tech India and innovate for the Fortune #1 company.",
         "about_company": "Human-led and tech-empowered since 2002, Walmart Global Tech India aims to create an omnichannel shopping experience for their customers and members across the globe to help them save money and live better. Walmart CodeHers 2022 is an opportunity for young women from engineering colleges across India to land their dream job.",
         "job_post_date": "Mar 11, 2022",
         "job_post_time": "06:19:54",
         "images": {
            "logo": "walmart",
            "poster": "mcdonalds",
            "cover": "burgers"
          }
        },
        {
         "id": 2,
         "company": "TCS",
         "role": "System engineer",
         "location": "All over India",
         "ctc": "3.6 to 4 lpa",
         "type": "full time",
         "images": {
            "logo": "tcs",
            "poster": "mcdonalds",
            "cover": "burgers"
          },
         "experiance": "fresher",
         "branch": ["Btech","MCA","MBA","Mtech"],
         "percentage": 0.6,
         "cgpa": 6,
         "backlog": 1,
         "note": "After registering in the TCS portal and getting the TCS reference ID, you may fill up the excel sheet attached. Reps shall consolidate the details and send by 15.6.22, 10 am. Note that candidature will not be accepted without TCS reference ID (Reps shall ensure this). In case if you are not getting the link for TCS portal, you may try the following:Try using the incognito mode within chrome browser.Clear cache and history .",
         "requirments": "Percentage: Minimum 60% or 6 CGPA throughout academics including the highest qualification, till the latest semester for which results have been declared. If selected, the offer will be valid only if the 60% or 6 CGPA criteria is met after completion of the course, at the time of joining. Backlogs \/ Arrears \/ ATKT: The student should not have more than 1 (one) pending or active backlog \/ arrear \/ ATKT at the time of appearing for the TCS Selection process. If selected, no pending backlogs \/ arrears \/ ATKT will be permitted at the time of joining TCS. All pending backlogs \/ arrears \/ ATKT should be cleared within the course duration stipulated by the University.Gap \/ Break in Education: It is mandatory to declare academic gaps if any, during the period of education. Break in education should not be due to extended education (examinations cleared after the time stipulated by the Board \/ University). Any break in education should not exceed 24 months and is permissible only for valid reasons. Relevant document proof, as applicable, will be checked for gaps in education. Course Types: Only Full-Time courses will be considered (Part Time \/ Correspondence Courses will not be considered).NIOS: Students who have completed their Secondary and \/ or Senior Secondary course from NIOS (National Institute of Open Schooling) are also eligible to apply if the other courses are full time.Work Experience: Students with prior work experience of up to two years are eligible to apply for this hiring event.Age: A student should be of 18 to 28 years of age to participate in the ‘TCS NQT’.",
         "job_post_date": "Jun 12, 2022",
         "job_post_time": "09:55:50",
         "last_date": "15.6.22",
         "last_time": "10:00 am"
        },
        {
         "id": 3,
         "company": "Skillenza",
         "role": "Campus ambassador",
         "type": "full time",
         "experiance": "fresher",
         "branch": ["Btech","MCA","MBA","Mtech"],
         "percentage": "Nil",
         "cgpa": "Nil",
         "images": {
            "logo": "skillenza",
            "poster": "mcdonalds",
            "cover": "burgers"
          },
         "backlog": "Nil",
         "about_job": "Brand Building - by generating awareness about Skillenza.Creating and managing your Community on Skillenza.Influencing other coding clubs to create communities and use Skillenza’s platform for all kinds of coding activities.Churning innovative ideas on how Skillenza can associate with your University.Organizing events like hackathons\/meetups\/webinars\/seminars on Skillenza.Connecting us to the placement cell of your College\n\n\n\n\n",
         "about_company": "Skillenza is a full-stack talent engagement platform that enables students and young professionals to get assessed, identify gaps in their current skill levels and market requirements, get upskilled and showcase their talent through challenges and hackathons. Our learning paths enable our users to be ready for the right opportunity at the right company, be it a full-time job, internship or part-time gig.",
         "requirments": "Skillenza is looking for someone who stands apart from the crowd, inspires the masses, reviews new laws and handles power &amp; responsibilities alike.\n\nAre you someone who fits this profile?\nDo you have the dynamic personality to influence your college towards the right way?\n\nWell, then, here is a chance for you to become the eyes, ears and face of Skillenza at your campus. Apply now and convince us of what you are capable of and Skillenza will empower you to be the influencer you always wanted to be.\n",
         "job_post_date": "Jun 17, 2022",
         "job_post_time": "01:11:33"
        },
        {
         "id": 4,
         "company": "Infosys",
         "role": "Specialist Programmer,Digital Specialist Engineer ",
         "location": "Not specified",
         "ctc": "6.25 and 9.5 LPA",
         "type": "full time",
         "experiance": "fresher",
         "branch": ["B.Tech - CSE/ECE/AEI/EEE","M.Tech (CSE/ECE/EEE)","MCA"],
         "percentage": "Nil",
         "cgpa": "Nil",
         "backlog": "Nil",
         "images": {
            "logo": "infosys",
            "poster": "mcdonalds",
            "cover": "burgers"
          },
         "note": "Eligibility (B.Tech - CSE\/ECE\/AEI\/EEE; M.Tech (CSE\/ECE\/EEE); MCA) \/ For academic criteria refer attachment \/ Revert in the attached format by 8.7.22, 6 pm",
         "about_job": "We have a signature strategy to help our employees move forward by inspiring them to build technology solutions for the future, making sure their career never stands still, and we do this by navigating further together.We are keen to partner with your institute for the Infosys Campus Recruitment Program 2022-23. We will be hiring students from the 2023 batch for the niche technical roles of Specialist Programmer and Digital Specialist Engineer through this program.The compensation for Specialist Programmer role is INR 9.5 lakhs per annum and for Digital Specialist Engineer role it is INR 6.25 lakhs per annum.",
         "about_company": "Infosys is a global leader in next-generation digital services and consulting. Our purpose is to amplify human potential and create the next opportunity for people, businesses and communities. We enable more than 1,741 clients in more than 50 countries to navigate their digital transformation. We do it by enabling the enterprise with an AI-powered core, empowering the business with agile digital at scale, and our always-on learning agenda. Our team of 3,14,000+ employees makes this happen.\n",
         "requirments": "The test process would be a virtual online assessment and the shortlisted students would be required to undergo online or in-person interview to assess their technical and behavioral skills. The test will be conducted on 30th\/31st July, 2022",
         "job_post_date": "Jul 7, 2022",
         "job_post_time": "03:13:41",
         "last_date": "8.7.22",
         "last_time": "6:00 pm"
        },
        {
         "id": 5,
         "company": "Aurionpro",
         "role": "Trainee &gt; Software Developer",
         "location": "Trivandrum and Mumbai",
         "ctc": "3.5-4.5 LPA",
         "type": "full time",
         "images": {
            "logo": "aurionpro",
            "poster": "mcdonalds",
            "cover": "burgers"
          },
         "experiance": "fresher",
         "branch": ["B.Tech- CSE","M.Tech - CSE","MCA"],
         "percentage": "Nil",
         "cgpa": 6,
         "backlog": "Nil",
         "note": "Eligibility (B.Tech- CSE\/M.Tech - CSE)\/MCA; Slab 1; Revert in the attached format by 29.7.22 10am",
         "about_job": "We have a bond for 2 yrs of 2 Lakhs. Students who are planning for higher studies in a years’ time need not apply.",
         "about_company": "Aurionpro is an IT Product and Services based MNC which Employees more than 1,700 domain and technology experts across North America, Asia and Europe, UAE. We help enterprises to embrace Digital Transformation across Banking, Mobility, Payments and Government sectors through a platform led approach. We are CMMI level organization and Great place to work certified.\nAurionpro caters to a host of clients across BFSI, Telecom, Digital Solutions for Government and Logistics industry.\n",
         "requirments": "Technologies we work on: DotNet \/ Angular \/ DotNet Core\/ Murex\/ Java\/ AWS \/ QA ",
         "job_post_date": "Jul 28, 2022",
         "job_post_time": "02:13:34",
         "last_date": "29.7.22",
         "last_time": "10:00 am"
        },
        {
         "id": 6,
         "company": "Cognizant",
         "role": "Software Engineering",
         "location": "Not specified",
         "ctc": "4 LPA",
         "type": "full time",
         "images": {
            "logo": "cognizant",
            "poster": "mcdonalds",
            "cover": "burgers"
          },
         "experiance": "fresher",
         "branch": ["B.Tech (ME/CE/IE)", "M.Tech (ME/CE)","B.Tech (CSE/ECE/AEI/EEE)", "M.Tech (CS/ECE/EEE)", "MCA"],
         "percentage": "Nil",
         "cgpa": "Nil",
         "backlog": "Nil",
         "note": "Eligibility (B.Tech - All branches\/M.Tech - All branches\/MCA); Slab 1 (Bulk recruitment); Register before 7th Aug 2002. Make sure you give the correct mail id.",
         "about_job": "Students of B.Tech (ME\/CE\/IE) and M.Tech (ME\/CE) shall register only for GenC\n\nStudents of B.Tech (CSE\/ECE\/AEI\/EEE), M.Tech (CS\/ECE\/EEE), MCA shall register for either GenC Elevate or GenC (any one); If the students have fundamental knowledge of programming they can register for GenC Elevate, else they can register for GenC\n\n \n\nGo through the registration portal carefully and submit all the required information as per the guidelines mentioned. Registrations open till 7th August 2022. Copy the below registration url to the browser and register.",
         "about_company": "With digital business growing immensely, we are eager to have talented minds like you as a part of our dynamic teams. We are glad to share the registration link for the hiring categories – GenC and GenC Elevate. Note the following while registering:",
         "job_post_date": "Aug 1, 2022",
         "job_post_time": "10:08:37",
         "last_date": "7\/7\/2022"
        },
        {
         "id": 7,
         "company": "Accenture",
         "role": "Software Engineering",
         "location": "Not specified",
         "ctc": "4.5 lpa",
         "type": "full time",
         "experiance": "fresher",
         "branch": ["B.Tech - All branches", "M.Tech - All branches" ,"MCA"],
         "percentage": 0.6,
         "cgpa": "Nil",
         "backlog": 0,
         "note": "Revert with the candidate list in the attached format by 4.8.22 9am. Registration of the candidates will happen based on the filled in excel sheet.Please note that PAN or E-PAN is necessary for the registration process which will happen by this weekend.",
         "job_post_date": "Aug 2, 2022",
         "job_post_time": "02:12:04",
         "last_date": "4.8.22",
         "images": {
            "logo": "accenture",
            "poster": "mcdonalds",
            "cover": "burgers"
          },
         "last_time": "9:00 am"
        },
        {
         "id": 8,
         "company": "Ernst and Young",
         "role": "cybersecurity",
         "location": "Not specified",
         "ctc": "4lpa",
         "type": "full time",
         "experiance": "fresher",
         "images": {
            "logo": "ey",
            "poster": "mcdonalds",
            "cover": "burgers"
          },
         "branch": ["B.Tech","M.Tech","MCA"],
         "percentage": "Nil",
         "cgpa": "Nil",
         "backlog": "Nil",
         "note": "Students should have learned at least one course on cybersecurity\/Information security in their course",
         "requirments": "who have done any cyber security course.have the cyber security related subjects as part of their curriculum.have done any relevant projects and internships in cyber security\n\n",
         "job_post_date": "Aug 3, 2022",
         "job_post_time": "12:55:21",
         "last_date": "3.8.22"
        },
        {
         "id": 9,
         "company": "USI Deloitte Consulting",
         "role": "Analyst",
         "location": "Not specified",
         "ctc": "7,60,000 CTC",
         "type": "full time",
         "experiance": "fresher",
         "branch": ["B.Tech - CSE/ECE/AEI/EEE/ME/CE","M.Tech - CSE", "MCA"],
         "percentage": "Nil",
         "cgpa": 6.5,
         "images": {
            "logo": "deloitte",
            "poster": "mcdonalds",
            "cover": "burgers"
          },
         "backlog": 0,
         "note": "Candidates shall first register in the link given and then fill up the attached excel sheet (both registration in link and filling the attached excel sheet is compulsory). Complete the registration before  5.8.22, 12pm and reps shall send the filled in excel sheet containing the registered students by 1.30 pm  \nRegistration procedure is attached...refer before registering\n\nTest date: 8.8.22 ; Interview date: 10.8.22 9am onwards",
         "job_post_date": "Aug 4, 2022",
         "job_post_time": "10:25:02",
         "last_date": "5.8.22",
         "last_time": "12:00 pm"
        },
        {
         "id": 10,
         "company": "PieInfocomm",
         "role": "Jr. Software Developer",
         "location": "Not specified",
         "images": {
            "logo": "pieInfocomm",
            "poster": "mcdonalds",
            "cover": "burgers"
          },
         "ctc": "3-4.5 LPA",
         "type": "full time",
         "experiance": "fresher",
         "branch": ["B.Tech - All branches","MCA", "BArch"],
         "percentage": 0.6,
         "cgpa": "Nil",
         "backlog": 0,
         "note": "Eligibility (B.Tech - All branches) \/ MCA\/ BArch also shall give the list. 60% in X, XII, and UG\/PG. No backlogs at time of joining. Details attached...Revert in the attached format by 5.8.22 4 pm",
         "job_post_date": "Aug 5, 2022",
         "job_post_time": "02:14:08",
         "last_date": "5.8.22",
         "last_time": "4:00 pm"
        },
        {
         "id": 11,
         "company": "Société Générale",
         "role": "Software Engineeri",
         "location": "Bangalore and Chennai",
         "ctc": "6.62 LPA",
         "type": "full time",
         "experiance": "fresher",
         "images": {
            "logo": "socgen",
            "poster": "mcdonalds",
            "cover": "burgers"
          },
         "branch": ["B.Tech (CSE/ECE/AEI/EEE)","M.Tech (CSE/ECE/EEE)","MCA"],
         "percentage": 0.6,
         "cgpa": 6,
         "backlog": 0,
         "note": "Revert in the attached format by 6.8.22 5pm",
         "job_post_date": "Aug 5, 2022",
         "job_post_time": "04:11:48",
         "last_date": "6.8.22",
         "last_time": "5:00 pm"
        },
        {
         "id": 12,
         "company": "Quantiphi",
         "role": "Machine Learning Engineer,Framework Engineer,Business Analyst\n\n",
         "location": "Trivandrum",
         "ctc": "5 LPA",
         "type": "full time",
         "experiance": "fresher",
         "images": {
            "logo": "quantiphi",
            "poster": "mcdonalds",
            "cover": "burgers"
          },
         "branch": ["B.Tech - All branches","MCA"],
         "percentage": 0.65,
         "cgpa": "Nil",
         "backlog": 0,
         "note": "Revert in the attached format by 10.8.22 5pm",
         "about_company": "Founded in 2013, Quantiphi is an award-winning AI-first digital engineering company driven by the desire to reimagine and realize transformational opportunities at the heart of the business. We are passionate about our customers and obsessed with problem-solving to make products smarter, customer experiences frictionless, processes autonomous and businesses safer.\n\nWe put together a wide array of solutions that help businesses build AI products, find and retain high-value customers, improve operating efficiency and reduce risk across several industries including but not limited to Healthcare, Insurance, Media, Retail, Manufacturing, and Consumer Products and are in partnership with Google Cloud, AWS, NVIDIA, Looker, Snowflake, SAP and Tensorflow.",
         "job_post_date": "Aug 9, 2022",
         "job_post_time": "05:08:08",
         "last_date": "10.8.22",
         "last_time": "5:00 pm"
        },
        {
         "id": 13,
         "company": "Mindtree",
         "images": {
            "logo": "mindtree",
            "poster": "mcdonalds",
            "cover": "burgers"
          },
         "role": "Jr. Software Developer",
         "ctc": "4-6.5 LPA",
         "type": "full time",
         "experiance": "fresher",
         "branch": ["B.Tech-all branches"," M.Tech-all branches","MCA"],
         "percentage": "Nil",
         "cgpa": "Nil",
         "note": "Revert in the attached format by 19.8.22 9am; Strictly adhere to the format (refer the filling details given before filling); Any deviations will be summarily deleted.",
         "job_post_date": "Aug 18, 2022",
         "job_post_time": "01:46:37",
         "last_date": "19.8.22",
         "last_time": "9:00 am"
        }
       ]